# Ejercicios de agrupaciones

### 1. Importa las librerías necesarias

In [1]:
import pandas as pd
import numpy as np

### 2. Descágate el fichero que vamos a utilizar de [aquí](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### 3. Léetelo en una variable llamada drinks

In [3]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'
drinks = pd.read_csv(url)
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

### 4. ¿Qué continente bebe más cerveza?

In [38]:
df1 = drinks.groupby('continent')['beer_servings'].sum()
df1[df1==df1.max()]

continent
EU    8720
Name: beer_servings, dtype: int64

### 5. Para cada continente, imprime los estadísticos del consumo de vino

In [7]:
drinks.groupby('continent')['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### 6. Imprime la media del consumo de alcohol por continente para cada columna

In [9]:
drinks.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### 7. Imprime la mediana del consumo de alcohol por continente para cada columna

In [12]:
drinks.groupby('continent').median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### 8. Muestra la media, mínimo y máximo del consumo de alcohol

In [17]:
drinks['total_litres_of_pure_alcohol'].agg([np.mean, min, max])

mean     4.717098
min      0.000000
max     14.400000
Name: total_litres_of_pure_alcohol, dtype: float64

# Ejericio 2 - Ocupación

### 1. Importamos las librerías

### 2. Descárgate este fichero [link](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### 3. Léetelo a una variable llamada users.

In [41]:
users = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep='|')
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### 4. ¿Cuál es la media de edad por ocupación?

### 5. Descubre el ratio de hombres por ocupación y ordénalos de mayor a menor

In [57]:
def busca_hombre(x):
    if x == "M":
        return 1
    else:
        return 0


users['hombres'] = users['gender'].apply(busca_hombre)
a = users.groupby('occupation')['hombres'].mean().sort_values(ascending=False)

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: hombres, dtype: float64

In [59]:
users2 = users.groupby('occupation')['hombres'].sum() / users.groupby('occupation')['hombres'].count()
users2.sort_values(ascending = False)

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: hombres, dtype: float64

In [54]:
df = users.set_index('occupation')['gender'].apply(lambda x: 1 if x=='M' else 0).groupby('occupation').mean()
df

occupation
administrator    0.544304
artist           0.535714
doctor           1.000000
educator         0.726316
engineer         0.970149
entertainment    0.888889
executive        0.906250
healthcare       0.312500
homemaker        0.142857
lawyer           0.833333
librarian        0.431373
marketing        0.615385
none             0.555556
other            0.657143
programmer       0.909091
retired          0.928571
salesman         0.750000
scientist        0.903226
student          0.693878
technician       0.962963
writer           0.577778
Name: gender, dtype: float64

### 6. Para cada ocupación, saca las edades mínima y máxima

### 7. Para cada combinación de ocupacion y género, calcula la media de edad:

### 8. Para cada ocupación, porcentaje de hombres y mujeres

In [60]:
def funcion(x):
    if x == "M":
        return 1
    else:
        return 0
users["generon"] = users["gender"].apply(funcion)
users.groupby('occupation')['generon'].sum() #total hombres
users.groupby('occupation')['gender'].count() #total personas
df1= users.groupby('occupation')['generon'].sum() / users.groupby('occupation')['gender'].count()
df1 = df1.round(2)
df1.sort_values(ascending=False)

occupation
doctor           1.00
engineer         0.97
technician       0.96
retired          0.93
executive        0.91
programmer       0.91
scientist        0.90
entertainment    0.89
lawyer           0.83
salesman         0.75
educator         0.73
student          0.69
other            0.66
marketing        0.62
writer           0.58
none             0.56
artist           0.54
administrator    0.54
librarian        0.43
healthcare       0.31
homemaker        0.14
dtype: float64

In [79]:
def busca_hombre(x):
    if x == "M":
        return 1
    else:
        return 0
    
profesiones = users.copy()

profesiones['hombres'] = profesiones['gender'].apply(busca_hombre)

def busca_mujer(x):
    if x == "F":
        return 1
    else:
        return 0
    
profesiones['mujeres'] = profesiones['gender'].apply(busca_mujer)

h = profesiones.groupby('occupation')[['hombres']].sum() / profesiones.groupby('occupation')[['hombres']].count() * 100
m = profesiones.groupby('occupation')[['mujeres']].sum() / profesiones.groupby('occupation')[['mujeres']].count() * 100

{'hombres': occupation
 administrator    0.54
 artist           0.54
 doctor           1.00
 educator         0.73
 engineer         0.97
 entertainment    0.89
 executive        0.91
 healthcare       0.31
 homemaker        0.14
 lawyer           0.83
 librarian        0.43
 marketing        0.62
 none             0.56
 other            0.66
 programmer       0.91
 retired          0.93
 salesman         0.75
 scientist        0.90
 student          0.69
 technician       0.96
 writer           0.58
 dtype: float64,
 'Mujeres': occupation
 administrator    0.46
 artist           0.46
 doctor           0.00
 educator         0.27
 engineer         0.03
 entertainment    0.11
 executive        0.09
 healthcare       0.69
 homemaker        0.86
 lawyer           0.17
 librarian        0.57
 marketing        0.38
 none             0.44
 other            0.34
 programmer       0.09
 retired          0.07
 salesman         0.25
 scientist        0.10
 student          0.31
 technician       0.04
 writer           0.42
 dtype: float64}

In [87]:
tabla = pd.DataFrame({"hombres":h['hombres'], "Mujeres":m['mujeres']})
tabla

                  hombres    Mujeres
occupation
administrator   54.430380  45.569620
artist          53.571429  46.428571
doctor         100.000000   0.000000
educator        72.631579  27.368421
engineer        97.014925   2.985075
entertainment   88.888889  11.111111
executive       90.625000   9.375000
healthcare      31.250000  68.750000
homemaker       14.285714  85.714286
lawyer          83.333333  16.666667
librarian       43.137255  56.862745
marketing       61.538462  38.461538
none            55.555556  44.444444
other           65.714286  34.285714
programmer      90.909091   9.090909
retired         92.857143   7.142857
salesman        75.000000  25.000000
scientist       90.322581   9.677419
student         69.387755  30.612245
technician      96.296296   3.703704
writer          57.777778  42.222222

In [75]:
serie2 = 1 - df1
tabla = pd.DataFrame({"hombres":df1, "Mujeres":serie2})
tabla.apply(lambda x : x*100 )
tabla.apply(lambda x : pd.Series([x['hombres'] +"%", x['hombres'] +"%"]), axis=1)

# tabla

UFuncTypeError: ufunc 'add' did not contain a loop with signature matching types (dtype('<U32'), dtype('<U32')) -> dtype('<U32')

In [68]:
str(pd.Series(['a', 'a']))

'0    a\n1    a\ndtype: object'

# Regiment

### 1. Importa las librerías

### 2. Crea el siguiente ``DataFrame``

In [75]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### 3. Créate un DataFrame a partir de él y asígnalo a la variable ``regiment`` (indicándole las columnas)

### 4. ¿Cuál es la media de preTestScore del regimiento Nighthawks?

### 5. Muestra las estadísticas generales de cada compañía

### 6. ¿Cuál es la media de cada preTestScore de cada compañía?

### 7. Muestra la media de preTestScore agrupada por regimiento y compañía:

### 8. Muestra la media de preTestScore agrupada por regimiento y compañía sin el orden jerárquico, es decir, desapilando el índice y pasando a ser columnas

### 9. Agrupa el DataFrame entero por regimiento y compañía y obten sus medias

### 10. ¿Cuá es el número de observaciones en cada regimiento y compañía?